#+TITLE: Medley Curl Testbench
#+PROPERTY: header-args  :var host="http://localhost:8085"
#+PROPERTY: header-args+ :var json="application/json"
#+PROPERTY: header-args+ :var text="text/plain"
#+PROPERTY: header-args+ :var org="text/x-org"
#+PROPERTY: header-args+ :results output

This is a suite of code snippets for exercising app URLs with curl.

** POST
#+NAME: geodb_post
#+BEGIN_SRC sh :wrap export http
curl -i -d "action=update" "$host/geodb"
#+END_SRC

#+RESULTS: geodb_post
#+BEGIN_export http
#+END_export

